# 10 minutes to pandas
#### Resource: https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html

## Imports

In [1]:
import numpy as np
import pandas as pd

## Creating a series

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

## Creating a dataframe

In [4]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01  1.769834 -0.334961 -0.127816  1.577022
2013-01-02  1.369422  0.828671  0.571958  0.212755
2013-01-03 -0.737093 -0.477844 -0.661884  1.543208
2013-01-04  1.268302  0.665764 -1.546318 -0.541699
2013-01-05  0.889421  0.575032 -0.720547 -0.272519
2013-01-06 -0.844450 -0.952154 -0.062922 -1.066733

In [6]:
df2 = pd.DataFrame(
{
    "A": 1.0,
    "B": pd.Timestamp("20130102"),
    "C": pd.Series(1, index=list(range(4)), dtype="float32"),
    "D": np.array([3] * 4, dtype="int32"),
    "E": pd.Categorical(["test", "train", "test", "train"]),
    "F": "foo"
})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [7]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

## Viewing Data

In [8]:
df.head()

                   A         B         C         D
2013-01-01  1.769834 -0.334961 -0.127816  1.577022
2013-01-02  1.369422  0.828671  0.571958  0.212755
2013-01-03 -0.737093 -0.477844 -0.661884  1.543208
2013-01-04  1.268302  0.665764 -1.546318 -0.541699
2013-01-05  0.889421  0.575032 -0.720547 -0.272519

In [9]:
df.tail(3)

                   A         B         C         D
2013-01-04  1.268302  0.665764 -1.546318 -0.541699
2013-01-05  0.889421  0.575032 -0.720547 -0.272519
2013-01-06 -0.844450 -0.952154 -0.062922 -1.066733

In [10]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [12]:
df.to_numpy()

array([[ 1.76983393, -0.33496058, -0.12781551,  1.5770217 ],
       [ 1.36942219,  0.82867086,  0.57195757,  0.21275509],
       [-0.73709292, -0.47784407, -0.66188361,  1.54320811],
       [ 1.26830212,  0.66576437, -1.5463176 , -0.54169936],
       [ 0.8894209 ,  0.57503209, -0.72054687, -0.27251946],
       [-0.84444959, -0.95215435, -0.06292227, -1.06673335]])

In [13]:
df2.to_numpy() # Casted to object since numpy array need to have same data type

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [14]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.619239  0.050751 -0.424588  0.242005
std    1.128091  0.733795  0.723071  1.101633
min   -0.844450 -0.952154 -1.546318 -1.066733
25%   -0.330464 -0.442123 -0.705881 -0.474404
50%    1.078862  0.120036 -0.394850 -0.029882
75%    1.344142  0.643081 -0.079146  1.210595
max    1.769834  0.828671  0.571958  1.577022

In [15]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.769834    1.369422   -0.737093    1.268302    0.889421   -0.844450
B   -0.334961    0.828671   -0.477844    0.665764    0.575032   -0.952154
C   -0.127816    0.571958   -0.661884   -1.546318   -0.720547   -0.062922
D    1.577022    0.212755    1.543208   -0.541699   -0.272519   -1.066733

### Sorting by index

In [16]:
df.sort_index(axis=1)

                   A         B         C         D
2013-01-01  1.769834 -0.334961 -0.127816  1.577022
2013-01-02  1.369422  0.828671  0.571958  0.212755
2013-01-03 -0.737093 -0.477844 -0.661884  1.543208
2013-01-04  1.268302  0.665764 -1.546318 -0.541699
2013-01-05  0.889421  0.575032 -0.720547 -0.272519
2013-01-06 -0.844450 -0.952154 -0.062922 -1.066733

### Sorting by values

In [17]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-06 -0.844450 -0.952154 -0.062922 -1.066733
2013-01-03 -0.737093 -0.477844 -0.661884  1.543208
2013-01-01  1.769834 -0.334961 -0.127816  1.577022
2013-01-05  0.889421  0.575032 -0.720547 -0.272519
2013-01-04  1.268302  0.665764 -1.546318 -0.541699
2013-01-02  1.369422  0.828671  0.571958  0.212755

## Selection

### Getting

In [18]:
df["A"] # Selecting single column

2013-01-01    1.769834
2013-01-02    1.369422
2013-01-03   -0.737093
2013-01-04    1.268302
2013-01-05    0.889421
2013-01-06   -0.844450
Freq: D, Name: A, dtype: float64

In [19]:
df[1:4] # Selecting multiple rows

                   A         B         C         D
2013-01-02  1.369422  0.828671  0.571958  0.212755
2013-01-03 -0.737093 -0.477844 -0.661884  1.543208
2013-01-04  1.268302  0.665764 -1.546318 -0.541699

In [20]:
df["20130103":"20130106"]

                   A         B         C         D
2013-01-03 -0.737093 -0.477844 -0.661884  1.543208
2013-01-04  1.268302  0.665764 -1.546318 -0.541699
2013-01-05  0.889421  0.575032 -0.720547 -0.272519
2013-01-06 -0.844450 -0.952154 -0.062922 -1.066733

## Selection by label

df.loc[dates[0]] # row using label

In [21]:
df.loc[:,["A", "B"]]

                   A         B
2013-01-01  1.769834 -0.334961
2013-01-02  1.369422  0.828671
2013-01-03 -0.737093 -0.477844
2013-01-04  1.268302  0.665764
2013-01-05  0.889421  0.575032
2013-01-06 -0.844450 -0.952154

In [22]:
df.loc["20130102":"20130105", ["A", "B"]]

                   A         B
2013-01-02  1.369422  0.828671
2013-01-03 -0.737093 -0.477844
2013-01-04  1.268302  0.665764
2013-01-05  0.889421  0.575032

In [23]:
df.loc["20130102", "A"]

1.3694221944931755

In [24]:
df.at["20130102", "A"]

1.3694221944931755

## Selection by position

In [25]:
df.iloc[3] # Row with index 3

A    1.268302
B    0.665764
C   -1.546318
D   -0.541699
Name: 2013-01-04 00:00:00, dtype: float64

In [26]:
df.iloc[1:3, 1:4] # Rows with index 1 and 2, and columns with index 1,2 and 3

                   B         C         D
2013-01-02  0.828671  0.571958  0.212755
2013-01-03 -0.477844 -0.661884  1.543208

In [27]:
df.iloc[[0, 2, 3], [0, 2, 3]]

                   A         C         D
2013-01-01  1.769834 -0.127816  1.577022
2013-01-03 -0.737093 -0.661884  1.543208
2013-01-04  1.268302 -1.546318 -0.541699

In [28]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  1.369422  0.828671  0.571958  0.212755
2013-01-03 -0.737093 -0.477844 -0.661884  1.543208

In [29]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.334961 -0.127816
2013-01-02  0.828671  0.571958
2013-01-03 -0.477844 -0.661884
2013-01-04  0.665764 -1.546318
2013-01-05  0.575032 -0.720547
2013-01-06 -0.952154 -0.062922

In [30]:
df.iloc[1, 2] # Cell in row with index 1 and column with index 2

0.5719575729898503

In [31]:
df.iat[1, 2]

0.5719575729898503

## Boolean indexing

In [32]:
df[df["D"] > 0]

                   A         B         C         D
2013-01-01  1.769834 -0.334961 -0.127816  1.577022
2013-01-02  1.369422  0.828671  0.571958  0.212755
2013-01-03 -0.737093 -0.477844 -0.661884  1.543208

In [33]:
df[df > 0]

                   A         B         C         D
2013-01-01  1.769834       NaN       NaN  1.577022
2013-01-02  1.369422  0.828671  0.571958  0.212755
2013-01-03       NaN       NaN       NaN  1.543208
2013-01-04  1.268302  0.665764       NaN       NaN
2013-01-05  0.889421  0.575032       NaN       NaN
2013-01-06       NaN       NaN       NaN       NaN

In [34]:
df2 = df.copy()

In [35]:
df2["E"] = ["one", "one", "two", "three", "four", "three"]

In [36]:
df2

                   A         B         C         D      E
2013-01-01  1.769834 -0.334961 -0.127816  1.577022    one
2013-01-02  1.369422  0.828671  0.571958  0.212755    one
2013-01-03 -0.737093 -0.477844 -0.661884  1.543208    two
2013-01-04  1.268302  0.665764 -1.546318 -0.541699  three
2013-01-05  0.889421  0.575032 -0.720547 -0.272519   four
2013-01-06 -0.844450 -0.952154 -0.062922 -1.066733  three

In [37]:
df2[df2["E"].isin(["two", "four"])]

                   A         B         C         D     E
2013-01-03 -0.737093 -0.477844 -0.661884  1.543208   two
2013-01-05  0.889421  0.575032 -0.720547 -0.272519  four

## Setting

In [38]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [39]:
df["F"] = s1

### Setting values by label

In [40]:
df.at["20130102", "A"] = 0

### Setting values by position

In [41]:
df.iat[0, 1] = 0

### Setting a numpy array

In [42]:
df.loc[:, "D"] = np.array([5] * len(df))

In [43]:
df

                   A         B         C  D    F
2013-01-01  1.769834  0.000000 -0.127816  5  NaN
2013-01-02  0.000000  0.828671  0.571958  5  1.0
2013-01-03 -0.737093 -0.477844 -0.661884  5  2.0
2013-01-04  1.268302  0.665764 -1.546318  5  3.0
2013-01-05  0.889421  0.575032 -0.720547  5  4.0
2013-01-06 -0.844450 -0.952154 -0.062922  5  5.0

In [44]:
df2 = df.copy()

In [45]:
df2[df2 > 0] = df2 + 1
df2

                   A         B         C  D    F
2013-01-01  2.769834  0.000000 -0.127816  6  NaN
2013-01-02  0.000000  1.828671  1.571958  6  2.0
2013-01-03 -0.737093 -0.477844 -0.661884  6  3.0
2013-01-04  2.268302  1.665764 -1.546318  6  4.0
2013-01-05  1.889421  1.575032 -0.720547  6  5.0
2013-01-06 -0.844450 -0.952154 -0.062922  6  6.0

## Missing data

In [46]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])
df1

                   A         B         C  D    F   E
2013-01-01  1.769834  0.000000 -0.127816  5  NaN NaN
2013-01-02  0.000000  0.828671  0.571958  5  1.0 NaN
2013-01-03 -0.737093 -0.477844 -0.661884  5  2.0 NaN
2013-01-04  1.268302  0.665764 -1.546318  5  3.0 NaN

In [47]:
df1.at["20130102", "E"] = 1
df1

                   A         B         C  D    F    E
2013-01-01  1.769834  0.000000 -0.127816  5  NaN  NaN
2013-01-02  0.000000  0.828671  0.571958  5  1.0  1.0
2013-01-03 -0.737093 -0.477844 -0.661884  5  2.0  NaN
2013-01-04  1.268302  0.665764 -1.546318  5  3.0  NaN

In [48]:
df1.dropna(how="any")

              A         B         C  D    F    E
2013-01-02  0.0  0.828671  0.571958  5  1.0  1.0

In [49]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  1.769834  0.000000 -0.127816  5  5.0  5.0
2013-01-02  0.000000  0.828671  0.571958  5  1.0  1.0
2013-01-03 -0.737093 -0.477844 -0.661884  5  2.0  5.0
2013-01-04  1.268302  0.665764 -1.546318  5  3.0  5.0

In [50]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True   True
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

## Operations

## Stats

In [51]:
df.mean() # Across columns

A    0.391002
B    0.106578
C   -0.424588
D    5.000000
F    3.000000
dtype: float64

In [52]:
df.mean(1) # Across rows

2013-01-01    1.660505
2013-01-02    1.480126
2013-01-03    1.024636
2013-01-04    1.677550
2013-01-05    1.948781
2013-01-06    1.628095
Freq: D, dtype: float64

### Apply

In [53]:
df

                   A         B         C  D    F
2013-01-01  1.769834  0.000000 -0.127816  5  NaN
2013-01-02  0.000000  0.828671  0.571958  5  1.0
2013-01-03 -0.737093 -0.477844 -0.661884  5  2.0
2013-01-04  1.268302  0.665764 -1.546318  5  3.0
2013-01-05  0.889421  0.575032 -0.720547  5  4.0
2013-01-06 -0.844450 -0.952154 -0.062922  5  5.0

In [54]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  1.769834  0.000000 -0.127816   5   NaN
2013-01-02  1.769834  0.828671  0.444142  10   1.0
2013-01-03  1.032741  0.350827 -0.217742  15   3.0
2013-01-04  2.301043  1.016591 -1.764059  20   6.0
2013-01-05  3.190464  1.591623 -2.484606  25  10.0
2013-01-06  2.346014  0.639469 -2.547528  30  15.0

In [55]:
df.apply(lambda x: x.max() - x.min())

A    2.614284
B    1.780825
C    2.118275
D    0.000000
F    4.000000
dtype: float64

### Histogramming

In [56]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    2
1    3
2    4
3    3
4    1
5    6
6    3
7    1
8    2
9    3
dtype: int32

In [57]:
s.value_counts()

3    4
2    2
1    2
6    1
4    1
dtype: int64

### String methods

In [58]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])
s.str.upper()

0       A
1       B
2       C
3    AABA
4    BACA
5     NaN
6    CABA
7     DOG
8     CAT
dtype: object

In [59]:
s.str.len()

0    1.0
1    1.0
2    1.0
3    4.0
4    4.0
5    NaN
6    4.0
7    3.0
8    3.0
dtype: float64

## Merge

### Concat

In [60]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0  0.427831 -2.432976  1.090874  0.813036
1 -0.110186 -1.511834  0.877885 -0.626176
2 -1.240128 -0.003166  0.713172 -0.669281
3 -2.142884 -0.915328  0.973471 -1.526640
4 -1.240246 -1.617774 -1.867309  0.745634
5  0.480022  2.433798 -0.200881  0.089522
6 -0.319242 -1.878295 -1.147356 -0.203626
7 -1.103532  1.530874  0.375561 -0.383195
8  1.046680 -1.603099  0.231823 -0.914680
9  0.255199  0.474704 -1.024436 -0.278432

In [61]:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0  0.427831 -2.432976  1.090874  0.813036
 1 -0.110186 -1.511834  0.877885 -0.626176
 2 -1.240128 -0.003166  0.713172 -0.669281,
           0         1         2         3
 3 -2.142884 -0.915328  0.973471 -1.526640
 4 -1.240246 -1.617774 -1.867309  0.745634
 5  0.480022  2.433798 -0.200881  0.089522
 6 -0.319242 -1.878295 -1.147356 -0.203626,
           0         1         2         3
 7 -1.103532  1.530874  0.375561 -0.383195
 8  1.046680 -1.603099  0.231823 -0.914680
 9  0.255199  0.474704 -1.024436 -0.278432]

In [62]:
pd.concat(pieces)

          0         1         2         3
0  0.427831 -2.432976  1.090874  0.813036
1 -0.110186 -1.511834  0.877885 -0.626176
2 -1.240128 -0.003166  0.713172 -0.669281
3 -2.142884 -0.915328  0.973471 -1.526640
4 -1.240246 -1.617774 -1.867309  0.745634
5  0.480022  2.433798 -0.200881  0.089522
6 -0.319242 -1.878295 -1.147356 -0.203626
7 -1.103532  1.530874  0.375561 -0.383195
8  1.046680 -1.603099  0.231823 -0.914680
9  0.255199  0.474704 -1.024436 -0.278432

### Join

In [63]:
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})

In [64]:
left

   key  lval
0  foo     1
1  foo     2

In [65]:
right

   key  rval
0  foo     4
1  foo     5

In [66]:
pd.merge(pd.merge(left, right, on="key"), right, on="key")

   key  lval  rval_x  rval_y
0  foo     1       4       4
1  foo     1       4       5
2  foo     1       5       4
3  foo     1       5       5
4  foo     2       4       4
5  foo     2       4       5
6  foo     2       5       4
7  foo     2       5       5

In [67]:
left = pd.DataFrame({"key": ["foo", "bar"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "bar"], "rval": [4, 5]})

In [68]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  bar     2     5

## Grouping

In [69]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)
df

     A      B         C         D
0  foo    one  0.926694 -0.763359
1  bar    one  0.032720 -1.956945
2  foo    two  0.764089  0.422711
3  bar  three  1.304473 -1.189607
4  foo    two -1.151232  0.604773
5  bar    two  1.018309 -0.302395
6  foo    one -1.329340 -0.265802
7  foo  three  1.874092  0.138018

In [70]:
df.groupby("A").sum()

            C         D
A
bar  2.355503 -3.448947
foo  1.084302  0.136341

In [71]:
df.groupby(["A", "B"]).sum()

                  C         D
A   B
bar one    0.032720 -1.956945
    three  1.304473 -1.189607
    two    1.018309 -0.302395
foo one   -0.402646 -1.029161
    three  1.874092  0.138018
    two   -0.387143  1.027484